Revit 2026 API

# UIControlledApplicationLoadPackageContents Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void LoadPackageContents(
	string packageContentsPath
)
```
```vb
Public Sub LoadPackageContents (
	packageContentsPath As String
)
```
```cpp
public:
void LoadPackageContents(
	String^ packageContentsPath
)
```
```fsharp
member LoadPackageContents :
        packageContentsPath : string -> unit
```

#### Parameters

packageContentsPath String

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace